Enterprise_Serivces/Prod/Bronze4/CSLStoreAdministrationService/result1/Iteration1/t11_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <header>POST /StoreAdministrationService.svc HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: "http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceAlive"
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: cslstoreadministrationserviceqa1.testgs.pvt
Content-Length: 811

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://www.gamestop.com/services/core/contracts/2010/05/IServiceBase/IsServiceAlive&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:0a9666f5-3081-4ebb-83d6-ca0b6f634a9d&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://cslstoreadministrationserviceqa1.testgs.pvt/StoreAdministrationService.svc&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;IsServiceAlive xmlns="http://www.gamestop.com/services/core/contracts/2010/05" /&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Cache-Control: private
Content-Length: 396
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/8.5
X-AspNet-Version: 4.0.30319
Date: Tue, 17 Jan 2017 18:04:34 GMT

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;IsServiceAliveResponse xmlns="http://www.gamestop.com/services/core/contracts/2010/05"&gt;
      &lt;IsServiceAliveResult xmlns:a="http://www.gamestop.com/services/core/messages/2010/08" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;a:IsAlive&gt;true&lt;/a:IsAlive&gt;
      &lt;/IsServiceAliveResult&gt;
    &lt;/IsServiceAliveResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </response>
  </http>
</report>